src/toir_cfe/src/Catalogs/торо_ТехнологическиеОперации/торо_ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="32d0ce7a-2f3a-4670-823b-1e333a84a43a">
  <name>торо_ТехнологическиеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f80b760d-5141-4fdf-b723-fb9a6c0b7a26">
    <name>проф_КодТехнологическойОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/InformationRegisters/НаличиеФайлов/НаличиеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="060b2bb4-ca03-4da9-930f-7f91f6299a35">
  <name>НаличиеФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="394b1a1c-a7ae-41b7-a346-4bac99fa567d">
    <name>ЕстьФайлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ccfe4e36-80b6-419f-8bb3-c1046203d023">
    <name>ОбъектСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Catalogs/торо_ТехнологическиеОперации/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #157, Башинская А.Ю., 26.07.2023, добавление скрепки прикреп.файла 
	Список.ТекстЗапроса = "ВЫБРАТЬ
		|	Справочникторо_ТехнологическиеОперации.Ссылка КАК Ссылка,
		|	Справочникторо_ТехнологическиеОперации.ПометкаУдаления КАК ПометкаУдаления,
		|	Справочникторо_ТехнологическиеОперации.Родитель КАК Родитель,
		|	Справочникторо_ТехнологическиеОперации.ЭтоГруппа КАК ЭтоГруппа,
		|	Справочникторо_ТехнологическиеОперации.Код КАК Код,
		|	Справочникторо_ТехнологическиеОперации.Наименование КАК Наименование,
		|	Справочникторо_ТехнологическиеОперации.Валюта КАК Валюта,
		|	Справочникторо_ТехнологическиеОперации.Комментарий КАК Комментарий,
		|	Справочникторо_ТехнологическиеОперации.НормаВремени КАК НормаВремени,
		|	Справочникторо_ТехнологическиеОперации.Расценка КАК Расценка,
		|	Справочникторо_ТехнологическиеОперации.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
		|	Справочникторо_ТехнологическиеОперации.СодержаниеРабот КАК СодержаниеРабот,
		|	Справочникторо_ТехнологическиеОперации.Опасная КАК Опасная,
		|	Справочникторо_ТехнологическиеОперации.РаботаПовышеннойОпасности КАК РаботаПовышеннойОпасности,
		|	Справочникторо_ТехнологическиеОперации.СпособРасчетаПродолжительности КАК СпособРасчетаПродолжительности,
		|	Справочникторо_ТехнологическиеОперации.НаименованиеПолное КАК НаименованиеПолное,
		|	ВЫБОР
		|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА НаличиеФайлов.ЕстьФайлы
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЕстьФайлы
		|ИЗ
		|	Справочник.торо_ТехнологическиеОперации КАК Справочникторо_ТехнологическиеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
		|		ПО Справочникторо_ТехнологическиеОперации.Ссылка = НаличиеФайлов.ОбъектСФайлами";  
	
	НовыйЭлемент  = Элементы.Добавить("ЕстьФайлы", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеКартинки;      
	НовыйЭлемент.ПутьКДанным = "Список.ЕстьФайлы";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.КартинкаШапки    = БиблиотекаКартинок.Скрепка; 
	НовыйЭлемент.КартинкаЗначений = БиблиотекаКартинок.Скрепка;
		
	КолонкаСсылка = Элементы.Найти("Ссылка");
	Если КолонкаСсылка <> Неопределено Тогда
		Элементы.Переместить(НовыйЭлемент, Элементы.Список, КолонкаСсылка);
	КонецЕсли;                                         
	
	Если Элементы.Найти("Форматоро_Перейти") <> Неопределено 
			И Элементы.Форматоро_Перейти.ПодчиненныеЭлементы.Найти("ФормаОбработкаторо_РаботаСОбщимиПрисоединеннымиФайламиОбщиеПрисоединенныеФайлы") <> Неопределено Тогда     
		Элементы.Форматоро_Перейти.ПодчиненныеЭлементы.ФормаОбработкаторо_РаботаСОбщимиПрисоединеннымиФайламиОбщиеПрисоединенныеФайлы.Видимость = Ложь;
	КонецЕсли;
	//-- Проф-ИТ, #157, Башинская А.Ю., 26.07.2023, добавление скрепки прикреп.файла 
	
КонецПроцедуры
